# RAW EXCEL DATA TO CLEAN EXCEL DATA
import the raw excel data clean it and export it to clean excel.

I have created a new folder in D -> Python_Code -> RawData.xlsx

In [1]:
import pandas as pd

In [2]:
#Import the Raw excel Data 
_exceldf  = pd.read_excel(r'D:\Python_Code\RawData.xlsx')
_exceldf

                                          ADDR         DT NAME     time
0  45 rd, kenith street, btm, bangalore 500038 2022-04-03  abc  8:30:21
1            45 rd,  street, hitech, Hd 500038 2022-04-02  dec  5:30:21

In [3]:
_exceldf

                                          ADDR         DT NAME     time
0  45 rd, kenith street, btm, bangalore 500038 2022-04-03  abc  8:30:21
1            45 rd,  street, hitech, Hd 500038 2022-04-02  dec  5:30:21

In [4]:
_exceldf.columns

Index(['ADDR', 'DT', 'NAME', 'time'], dtype='object')

In [5]:
_exceldf.isna()

    ADDR     DT   NAME   time
0  False  False  False  False
1  False  False  False  False

In [6]:
_exceldf.isnull().sum()

ADDR    0
DT      0
NAME    0
time    0
dtype: int64

In [7]:
#Step 1 Clean the Address Column split it in to House Addr,Street,City,State_Zip
_exceldf[['Houseadd','Street','City','State_Zip']] = _exceldf['ADDR'].str.split(',',expand = True)
_exceldf

,ADDR,DT,NAME,time,Houseadd,Street,City,State_Zip
0,"45 rd, kenith street, btm, bangalore 500038",2022-04-03,abc,8:30:21,45 rd,kenith street,btm,bangalore 500038
1,"45 rd, street, hitech, Hd 500038",2022-04-02,dec,5:30:21,45 rd,street,hitech,Hd 500038

In [8]:
#Step2 as State Zip is not comma seperated we need to split based on Space
_exceldf['State_Zip'] = _exceldf['State_Zip'].str.strip()
_exceldf[['State','Zip']] = _exceldf['State_Zip'].str.split(' ',expand = True)
_exceldf

,ADDR,DT,NAME,time,Houseadd,Street,City,State_Zip,State,Zip
0,"45 rd, kenith street, btm, bangalore 500038",2022-04-03,abc,8:30:21,45 rd,kenith street,btm,bangalore 500038,bangalore,500038
1,"45 rd, street, hitech, Hd 500038",2022-04-02,dec,5:30:21,45 rd,street,hitech,Hd 500038,Hd,500038

In [9]:
#Step 3 to split the date column in to Year month Date
_exceldf['DT'] = _exceldf['DT'].astype(str)
_exceldf[['Year','Month','Date']] = _exceldf['DT'].str.split('-',expand = True)
_exceldf

,ADDR,DT,NAME,time,Houseadd,Street,City,State_Zip,State,Zip,Year,Month,Date
0,"45 rd, kenith street, btm, bangalore 500038",2022-04-03,abc,8:30:21,45 rd,kenith street,btm,bangalore 500038,bangalore,500038,2022,04,03
1,"45 rd, street, hitech, Hd 500038",2022-04-02,dec,5:30:21,45 rd,street,hitech,Hd 500038,Hd,500038,2022,04,02

In [10]:
#Step 4 to split the time column in to Hour Minutes and Seconds
_exceldf[['Hour','Minutes', 'Seconds']] = _exceldf['time'].str.split(':',expand=True)
_exceldf

,ADDR,DT,NAME,time,Houseadd,Street,City,State_Zip,State,Zip,Year,Month,Date,Hour,Minutes,Seconds
0,"45 rd, kenith street, btm, bangalore 500038",2022-04-03,abc,8:30:21,45 rd,kenith street,btm,bangalore 500038,bangalore,500038,2022,04,03,8,30,21
1,"45 rd, street, hitech, Hd 500038",2022-04-02,dec,5:30:21,45 rd,street,hitech,Hd 500038,Hd,500038,2022,04,02,5,30,21

In [11]:
#Delete the Raw / Old Columns from the Dataframe object

_exceldf = _exceldf.drop(['ADDR', 'DT','time','State_Zip'], axis=1)
_exceldf

,NAME,Houseadd,Street,City,State,Zip,Year,Month,Date,Hour,Minutes,Seconds
0,abc,45 rd,kenith street,btm,bangalore,500038,2022,04,03,8,30,21
1,dec,45 rd,street,hitech,Hd,500038,2022,04,02,5,30,21

In [12]:
#export the excelDataFrame object to Clean excel Data
# Arranged the header and exported the columns based on cleanData output files

_exceldf[['Houseadd','Street','City','State','Zip','Month','Date','Year','NAME','Hour','Minutes','Seconds']].to_excel(r"D:\Python_Code\CleanData.xlsx")